Revit 2024 API
CustomExporter.IncludeGeometricObjects Property
 This flag sets the exporter to either include or exclude output of geometric objects such as faces and curves when the model is being processed by the export context.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IncludeGeometricObjects { get; set; }
Visual Basic
Public Property IncludeGeometricObjects As Boolean
	Get
	Set
Visual C++
public:
property bool IncludeGeometricObjects {
	bool get ();
	void set (bool value);
}
Remarks
If geometric objects are to be excluded, the context will not receive any of the calls to related to Faces or Curves. However, the objects will be still processed by Revit resulting in exporting their tessellated geometry in form of polymeshes or lines, respectivelly.
Regardless of the value of this property, the export context must always implement the methods related to receiving of geometric objects (e.g. OnFaceStart, OnFaceEnd, OnCurve, etc.), even though the methods may never be invoked.
Setting this property to False allows clients to significantly speed up the export process. If the export context does not need to examine geometric objects, it is recommended setting this property to False, which will make the export process faster even when compared with export during which notifications about geometric objects are sent, but ignored by the context.
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace